import React from 'react'
import InvisableIntroductionBox from './invisable-introduction-box/InvisableIntroductionBox'

function IntroductionBox() {

    return (
        <div className='text-[var(--desc-color)]'>
            <p className='mb-5'>
                من یک توسعه‌دهنده فرانت‌اند با بیش از سه سال تجربه هستم که مسیر یادگیری خود را به صورت خودآموز آغاز کردم. از همان ابتدای راه، علاقه و اشتیاق زیادی به دنیای طراحی وب و خلق رابط‌های کاربری داشتم و با مطالعه و تمرین مداوم توانستم دانش خود را در زمینه‌های مختلف این حوزه گسترش دهم.
            </p>

            <p className='mb-5'>
                در طول این مدت، مهارت‌های متنوعی در زمینه‌های HTML، CSS، JavaScript و کتابخانه محبوب React کسب کرده‌ام. همچنین با ابزارها و فریم‌ورک‌هایی مثل Tailwind CSS و Bootstrap تجربه کار دارم و توانسته‌ام رابط‌های کاربری مدرن، واکنش‌گرا و بهینه طراحی کنم که هم زیبا و هم کاربرپسند باشند.
            </p>

            <p className='mb-5'>
                یکی از نقاط قوت من علاقه به کار تیمی و مشارکت در پروژه‌های گروهی است. همیشه سعی کرده‌ام در محیط تیمی نه تنها وظایف خود را به بهترین شکل انجام دهم، بلکه در یادگیری و انتقال تجربه به دیگران هم سهیم باشم. باور دارم که موفقیت در پروژه‌های نرم‌افزاری در گرو همکاری و همفکری اعضای تیم است.
            </p>
            <InvisableIntroductionBox />
        </div>
    )
}

export default IntroductionBox